# Pandas DataFrame (22MIA1064 Y@sir Ahmad)

In [1]:
import numpy as np
import pandas as pd

# DataFrame  
A Data Frame is a 2D data structure, i.e. data is aligned in a tabular fashion in rows and columns.
* Potentially columns are of different types
* Size - mutable
* Labeled axes (rows and columns)
* Can Perform Arithmetic operations on rows and columns   

**Syntax**:
> `pd.DataFrame(data,index,column,dtype,copy)`  

## Creating DataFrame form 1D lists

In [2]:
df = pd.DataFrame() #empty
print(df)

Empty DataFrame
Columns: []
Index: []

<u>**append columns to an empty DataFrame**

In [3]:
df["Name"] = ["Ankit","Ankita","Yashvardhan"]
df["Age"] = [19,18,20]
df["Gender"] = ['M','F','M']
df

          Name  Age Gender
0        Ankit   19      M
1       Ankita   18      F
2  Yashvardhan   20      M

<u>**delete columns from dataframe**

In [5]:
del(df['Age'])
df

          Name Gender
0        Ankit      M
1       Ankita      F
2  Yashvardhan      M

<u>**add new column**

In [8]:
df['GPA'] = [9.8,7.8,9]
df

          Name Gender  GPA
0        Ankit      M  9.8
1       Ankita      F  7.8
2  Yashvardhan      M  9.0

## Creating DataFrame form dictionary  
   
Create a dictionary and pass dictionary into `pd.DataFrame` constructor as argument

In [12]:
d = {'subj':['Maths','Science','Social Science','Computer Science'],'marks':[100,98,87,89],'grade':('A','A','B','B')}
d

{'subj': ['Maths', 'Science', 'Social Science', 'Computer Science'],
 'marks': [100, 98, 87, 89],
 'grade': ('A', 'A', 'B', 'B')}

In [15]:
df = pd.DataFrame(d)
df

               subj  marks grade
0             Maths    100     A
1           Science     98     A
2    Social Science     87     B
3  Computer Science     89     B

## Creating DataFrame form Series   
  
Create Series for each column.  
Pass list of Series to `pd.DataFrame`constructor

In [18]:
subj = pd.Series(['Maths','Science','Social Science','Computer Science'])
marks = pd.Series([100,98,87,89])
grade = pd.Series(('A','A','B','B'))

df = pd.DataFrame([subj,marks,grade])
df

       0        1               2                 3
0  Maths  Science  Social Science  Computer Science
1    100       98              87                89
2      A        A               B                 B

<u>**create Transpose and add index values**</u>

In [21]:
df = pd.DataFrame([subj,marks,grade],index=['subj','marks','grade']).T
df

               subj marks grade
0             Maths   100     A
1           Science    98     A
2    Social Science    87     B
3  Computer Science    89     B

## Creating DataFrame form 2D list  
  
2D list can also be used to create DataFrame

In [23]:
df1 = pd.DataFrame([[1,2],[3,4]],columns=['a','b'])
df1

   a  b
0  1  2
1  3  4

In [36]:
df2 = pd.DataFrame([[56,74,45],[12,89,32]],columns=['a','b','c'],index=['x','y'])
df2

    a   b   c
x  56  74  45
y  12  89  32

<u>**add columns**

In [37]:
df2['d'] = [66,97]

<u>**add rows**

In [35]:
#add rows 
df2.append(df1)

/tmp/ipykernel_5909/2982188061.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df2.append(df1)

    a   b     c     d
x  56  74  45.0  66.0
y  12  89  32.0  97.0
0   1   2   NaN   NaN
1   3   4   NaN   NaN

In [46]:
df2.loc[len(df2.index)] = [66,97,21,9]
df2

    a   b   c   d
x  56  74  45  66
y  12  89  32  97
2  66  97  21   9
3  66  97  21   9

In [48]:
df2 = df2.drop('x')
df2

    a   b   c   d
y  12  89  32  97
2  66  97  21   9
3  66  97  21   9

### Accessing elements in DataFrame

In [49]:
df

               subj marks grade
0             Maths   100     A
1           Science    98     A
2    Social Science    87     B
3  Computer Science    89     B

In [51]:
df.loc[2]

subj     Social Science
marks                87
grade                 B
Name: 2, dtype: object

In [52]:
df.loc[2].subj

'Social Science'

# Question  
Create a dataframe for 4 students having columns Name,CAT1_marks,CAT2_marks,FAT_marks. Add new row 'Pavan',23,23,41 to existing dataframe. Include a column 'Total' to store total marks of each student. Finally sort the DataFrame by total marks

In [70]:
#creation
name = ['Ankit','Ankita','Yashv','Vikal']
CT1 = [16,22,24,25]
CT2 = [18,24,21,23]
FT = [45,50,37,49]
d = {'Name':name,'CAT1_marks':CT1,'CAT2_marks':CT2,'FAT_marks':FT}

In [71]:
df = pd.DataFrame(d)
df

     Name  CAT1_marks  CAT2_marks  FAT_marks
0   Ankit          16          18         45
1  Ankita          22          24         50
2   Yashv          24          21         37
3   Vikal          25          23         49

In [72]:
#adding row pavan
df.loc[len(df.index)] = ['Pavan',23,23,41]
df

     Name  CAT1_marks  CAT2_marks  FAT_marks
0   Ankit          16          18         45
1  Ankita          22          24         50
2   Yashv          24          21         37
3   Vikal          25          23         49
4   Pavan          23          23         41

In [73]:
#adding column Total
df['Total'] = sum([df.CAT1_marks,df.CAT2_marks,df.FAT_marks])
df

     Name  CAT1_marks  CAT2_marks  FAT_marks  Total
0   Ankit          16          18         45     79
1  Ankita          22          24         50     96
2   Yashv          24          21         37     82
3   Vikal          25          23         49     97
4   Pavan          23          23         41     87

In [79]:
#sorting
df.sort_values('Total')

     Name  CAT1_marks  CAT2_marks  FAT_marks  Total
0   Ankit          16          18         45     79
2   Yashv          24          21         37     82
4   Pavan          23          23         41     87
1  Ankita          22          24         50     96
3   Vikal          25          23         49     97

# Importing CSV Data  
  
Import weather.csv

In [89]:
filepath = '/home/ex5/Downloads/pandasLab/weather.csv'
df_h = pd.read_csv(filepath)
df_h

   month  avg_low  avg_high  record_high  record_low  avg_preci
0    Jan       58        42           74          22       2.95
1    Feb       61        45           78          26       3.02
2    Mar       65        48           84          25       2.34
3    Apr       67        50           92          28       1.02
4    May       71        53           98          35       0.48
5    Jun       75        56          107          41       0.11
6    Jul       77        58          105          44       0.00
7    Aug       77        59          102          43       0.03
8    Sep       77        57          103          40       0.17
9    Oct       73        54           96          34       0.81
10   Nov       64        48           84          30       1.70
11   Dec       58        42           73          21       2.56

## Displaying data

`df.head()` returns first 5 records from data frame

In [109]:
df_h.head()

  month  avg_low  avg_high  record_high  record_low  avg_preci
0   Jan       58        42           74          22       2.95
1   Feb       61        45           78          26       3.02
2   Mar       65        48           84          25       2.34
3   Apr       67        50           92          28       1.02
4   May       71        53           98          35       0.48

`df.tail()` returns last 5 records from data frame

In [110]:
df_h.tail()

   month  avg_low  avg_high  record_high  record_low  avg_preci
7    Aug       77        59          102          43       0.03
8    Sep       77        57          103          40       0.17
9    Oct       73        54           96          34       0.81
10   Nov       64        48           84          30       1.70
11   Dec       58        42           73          21       2.56

`df.sample(n)` returns n random records from data frame

In [111]:
df_h.sample(5)

   month  avg_low  avg_high  record_high  record_low  avg_preci
6    Jul       77        58          105          44       0.00
5    Jun       75        56          107          41       0.11
4    May       71        53           98          35       0.48
9    Oct       73        54           96          34       0.81
10   Nov       64        48           84          30       1.70

In [112]:
###########################

In [113]:
df_h.describe()

         avg_low   avg_high  record_high  record_low  avg_preci
count  12.000000  12.000000    12.000000   12.000000  12.000000
mean   68.583333  51.000000    91.333333   32.416667   1.265833
std     7.366488   6.060303    12.323911    8.240238   1.186396
min    58.000000  42.000000    73.000000   21.000000   0.000000
25%    63.250000  47.250000    82.500000   25.750000   0.155000
50%    69.000000  51.500000    94.000000   32.000000   0.915000
75%    75.500000  56.250000   102.250000   40.250000   2.395000
max    77.000000  59.000000   107.000000   44.000000   3.020000

In [114]:
df_h['record_high'].max()

107

In [115]:
df_h[df_h['record_high'] == df_h['record_high'].max()]

  month  avg_low  avg_high  record_high  record_low  avg_preci
5   Jun       75        56          107          41       0.11